import re

values = [
    ['а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з'],
    ['и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р'],
    ['с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ'],
    ['ъ', 'ы', 'ь', 'э', 'ю', 'я', 'А', 'Б', 'В'],
    ['Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К'],
    ['Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У'],
    ['Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь'],
    ['Э', 'Ю', 'Я', ' ', '.', ':', '!', '?', ',']
]

pattern = r'[А-я,.:;?! ]+'
phrase = input('Введите фразу с клавиатуры: ')
while re.fullmatch(pattern, phrase) is None:
    phrase = input('Введенная строка некоректна, повторите ввод: ')
number = []

print('Зашифрованная фраза: ', end='')
for p in phrase:
    for i in range(len(values)):
        if p in values[i]:
            print(str(i + 1) + str(values[i].index(p) + 1), end=" ")
            number.append([i + 1, values[i].index(p) + 1])
print()
###########################################
#########Обратная операция#################
###########################################
print('Расшифрованная фраза: ', end='')
for n in number:
    print(values[n[0] - 1][n[1] - 1], end='')
